/*
Есть игровое поле размером 30 х 60 (по у, по х). На игровом поле два игрока (вы и противник).
Попросить у пользователя координаты игроков.  (Проверять на правильность вводимых координат).
Вывести информацию
 в каком направлении находится от вас игрок (east, west, north, south, south-west, …),
 какое к нему расстояние (по х и по у),
 какое растояние между игроками (точками) ( в <cmath> есть корень  ).
cout << sqrt(9); // выведет 3
- если расстояние меньше 3, вывести сообщение («hit»), если больше 3, вывести
- или если больше 3, подойти к нему (поменять координаты).
сообщение («fire»).

*/

using namespace std;

void f124()
{
    cout << "124" << endl;

    return;
}
